diplom-src/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>InformationRegister.ВКМ_ПланОтпусков</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom-src/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаАнализГрафика/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтпускаСотрудников = ПолучитьИзВременногоХранилища(Параметры.Адрес);
	Год = Параметры.Год;
	
	ДиаграммаГанта.Обновление = Ложь;
	ДиаграммаГанта.АвтоОпределениеПолногоИнтервала = Ложь;
	ДиаграммаГанта.Очистить();
	
	ДиаграммаГанта.УстановитьПолныйИнтервал(НачалоГода(Год), КонецГода(Год));
	Серия = ДиаграммаГанта.УстановитьСерию("Отпуска");
	
	Для Каждого Строка Из ОтпускаСотрудников Цикл  
		
		Точка = ДиаграммаГанта.УстановитьТочку(Строка.Сотрудник);
		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
		Значение.Данные.ДнейОтпуска = Значение.Данные.ДнейОтпуска + Строка.ДнейОтпуска;
		Если Строка.ДнейОтпуска > 28 Тогда
			Значение.ЦветФона = WebЦвета.СветлоРозовый;
		КонецЕсли;
		
		Интервал = Значение.Добавить();
		Интервал.Начало = Строка.ДатаНачала;
		Интервал.Конец = Строка.ДатаОкончания;	
		
	КонецЦикла;
	
	ДиаграммаГанта.Обновление = Истина;

КонецПроцедуры

#КонецОбласти
